IrinaAnokhina/MotionLib_IMU/MFX_1709.ioc
STMicroelectronics.X-CUBE-MEMS1.6.2.03.BSP.i2caddr=0
STMicroelectronics.X-CUBE-MEMS1.6.2.03.BSP.i2creg=
STMicroelectronics.X-CUBE-MEMS1.6.2.03.BSP.instance=I2C1
STMicroelectronics.X-CUBE-MEMS1.6.2.03.BSP.ip=I2C
STMicroelectronics.X-CUBE-MEMS1.6.2.03.BSP.mode=I2C
STMicroelectronics.X-CUBE-MEMS1.6.2.03.BSP.name=IKS01A2 BUS IO driver
STMicroelectronics.X-CUBE-MEMS1.6.2.03.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.6.2.03.BSP.solution=I2C1
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.STBoard=false
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.api=BSP_BUS_DRIVER
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.condition=SEMBoardOoComponentJjPressTempJjLPS22HBJjI2C
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.i2caddr=0
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.i2creg=
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.instance=I2C1
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.ip=I2C
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.mode=I2C
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.name=LPS22HB BUS IO driver
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.6.2.04.BSP.solution=I2C1
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.STBoard=false
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.api=BSP_COMMON_DRIVER
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.condition=
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.i2caddr=0
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.i2creg=
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.instance=PC13-ANTI_TAMP
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.ip=GPIO
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.mode=EXTI
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.name=BSP BUTTON
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.6.2.05.BSP.solution=PC13-ANTI_TAMP
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.STBoard=false
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.api=BSP_COMMON_DRIVER
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.condition=
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.i2caddr=0
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.i2creg=
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.instance=USART2
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.ip=(LPU|US)ART
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.mode=Asynchronous
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.name=BSP USART
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.6.2.06.BSP.solution=USART2
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.STBoard=false
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.api=BSP_COMMON_DRIVER
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.component=
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.condition=
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.i2caddr=0
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.i2creg=
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.instance=PA5
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.ip=GPIO
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.mode=Output
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.name=BSP LED
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.semaphore=
STMicroelectronics.X-CUBE-MEMS1.6.2.07.BSP.solution=PA5
STMicroelectronics.X-CUBE-MEMS1.6.2.0_BoardOoComponentJjMEMS_RteComponent0=\#define LSM6DSL_ACCGYR_I2C
STMicroelectronics.X-CUBE-MEMS1.6.2.0_BoardOoComponentJjMEMS_RteComponent1=\#define LSM303AGR_ACCMAG_I2C
STMicroelectronics.X-CUBE-MEMS1.6.2.0_BoardOoComponentJjMEMS_RteComponent2=\#define HTS221_HUMTEMP_I2C
STMicroelectronics.X-CUBE-MEMS1.6.2.0_BoardOoComponentJjMEMS_RteComponent3=\#define LPS22HB_PRESSTEMP_I2C
STMicroelectronics.X-CUBE-MEMS1.6.2.0_BoardOoComponentJjMEMS_RteComponentsize=4
STMicroelectronics.X-CUBE-MEMS1.6.2.0_BoardOoExtensionJjMEMS_RteComponent0=\#define IKS01A2
STMicroelectronics.X-CUBE-MEMS1.6.2.0_BoardOoExtensionJjMEMS_RteComponentsize=1
STMicroelectronics.X-CUBE-MEMS1.6.2.0_BoardOoSupportJjSTM32CubeIiCustomIiBSPIiDrivers_RteComponentsize=0
STMicroelectronics.X-CUBE-MEMS1.6.2.0_DeviceJjApplication_RteComponent0=\#define IKS01A2_DATALOGTERMINAL_DEMO
STMicroelectronics.X-CUBE-MEMS1.6.2.0_DeviceJjApplication_RteComponentsize=1
STMicroelectronics.X-CUBE-MEMS1.6.2.0_MwName0=Application
STMicroelectronics.X-CUBE-MEMS1.6.2.0_NumberOfMw=1
STMicroelectronics.X-CUBE-MEMS1.6.2.0_SwParameter=MEMSCcBoardOoComponentJjAccGyrJjLSM6DSL\:I2C;ApplicationCcDeviceJjApplication\:IKS01A2IiDataLogTerminal;MEMSCcBoardOoComponentJjHumTempJjHTS221\:I2C;MEMSCcBoardOoComponentJjAccMagJjLSM303AGR\:I2C;MEMSCcBoardOoExtensionJjIKS01A2\:true;MEMSCcBoardOoComponentJjPressTempJjLPS22HB\:I2C;
STMicroelectronics.X-CUBE-MEMS1.6.2.0_description=Drivers and sample applications for MEMS components
STMicroelectronics.X-CUBE-MEMS1.6.2.0_license=en.DM00367782.pdf
TIM3.IPParameters=Prescaler,Period
TIM3.Period=20-1
TIM3.Prescaler=42000-1
USART2.IPParameters=VirtualMode
USART2.VirtualMode=VM_ASYNC
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoComponentJjMEMS_6.2.0.Mode=BoardOoComponentJjMEMS
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoComponentJjMEMS_6.2.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoComponentJjMEMS_6.2.0
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoExtensionJjMEMS_6.2.0.Mode=BoardOoExtensionJjMEMS
VP_STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoExtensionJjMEMS_6.2.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_BoardOoExtensionJjMEMS_6.2.0
VP_STMicroelectronics.X-CUBE-MEMS1_VS_DeviceJjApplication_6.2.0.Mode=DeviceJjApplication
VP_STMicroelectronics.X-CUBE-MEMS1_VS_DeviceJjApplication_6.2.0.Signal=STMicroelectronics.X-CUBE-MEMS1_VS_DeviceJjApplication_6.2.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM3_VS_ClockSourceINT.Mode=Internal
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
board=NUCLEO-F401RE
boardIOC=true
